Revit 2027 API
ExternalFileUtils.GetAllExternalFileReferences Method
 Gets the ids of all elements which are external file references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetAllExternalFileReferences(
	Document aDoc
)
Public Shared Function GetAllExternalFileReferences (
	aDoc As Document
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetAllExternalFileReferences(
	Document^ aDoc
)
static member GetAllExternalFileReferences :
        aDoc : Document -> ICollection<ElementId>
Parameters
aDoc Document
 A Revit Document.
Return Value
ICollection<ElementId>
 The ids of all elements which are external file references.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This function will not return the ids of nested Revit links; it only returns top-level references.
See Also
Reference
ExternalFileUtils Class
Autodesk.Revit.DB Namespace